Revit 2024 API
MacroManager Class
 Manager object for the Macro modules of the application.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class MacroManager : IEnumerable<MacroModule>,
	IDisposable
Visual Basic
Public Class MacroManager _
	Implements IEnumerable(Of MacroModule), IDisposable
Visual C++
public ref class MacroManager : IEnumerable<MacroModule^>,
	IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Macros.MacroManager
See Also
MacroManager Members
Autodesk.Revit.DB.Macros Namespace